enfieldcat/ESP32_miniThrottle/connectMgr.ino
/*
miniThrottle, A WiThrottle/DCC-Ex Throttle for model train control

MIT License

Copyright (c) [2021-2024] [Enfield Cat]

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/


/*
 * Connection manager
 * 
 * Manage network connections
 * * Network connectivity
 * * estabilish controller connection
 * 
 * WiFi networks should not use hidden SSIDs, will connect to strongest signal
 * Cycle through controller list, connect to the first possible controller
 * 
 */
#ifdef USEWIFI
// static WiFiMulti wifiMulti;

void connectionManager(void *pvParameters)
{
  char paramName[SSIDLENGTH];
  char apssid[SSIDLENGTH];
  char appass[SSIDLENGTH];
  char stassid[SSIDLENGTH];
  char stapass[SSIDLENGTH];
  uint8_t index     = 0;
  uint8_t scanIndex = 0;
  uint8_t staPref   = 0;
  uint8_t bumpCount = 0;
  uint8_t mywifimode= 0;
  bool networkFound = false;
  bool ntptimeset   = false;

  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s connectionManager(NULL)\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }

  // Scan networks at startup just for the record
  /* if (xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10)) == pdTRUE) {
    wifi_scanNetworks(true);
    xSemaphoreGive(tcpipSem);
  }
  else semFailed ("tcpipSem", __FILE__, __LINE__); */
  mywifimode = nvs_get_int("WiFiMode", defaultWifiMode);
  switch (mywifimode) {
    case 1: WiFi.mode(WIFI_STA);    break;
    case 2: WiFi.mode(WIFI_AP);     break;
    case 3: WiFi.mode(WIFI_AP_STA); break;
  }
  WiFi.setMinSecurity(WIFI_AUTH_OPEN);
  // Start AP if required
  if ((mywifimode & 2) > 0) {
    nvs_get_string ("APname", apssid, tname,  sizeof(apssid));
    nvs_get_string ("APpass", appass, "none", sizeof(appass));
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("%s WiFi Access Point starting: %s\r\n", getTimeStamp(), apssid);
      xSemaphoreGive (consoleSem);
    }
    if (strlen(appass)<8) 
      WiFi.softAP(apssid, NULL, nvs_get_int ("apChannel", APCHANNEL), 0, nvs_get_int("apClients", DEFAPCLIENTS));
    else
      WiFi.softAP(apssid, appass, nvs_get_int ("apChannel", APCHANNEL), 0, nvs_get_int("apClients", DEFAPCLIENTS));
    APrunning  = true;
    MDNS.begin(tname);
  }
  while (true) {
    // Check if WiFi station mode needs to be connected and is connected
    if ((!ntptimeset) && WiFi.status() == WL_CONNECTED) {
      char ntpserver[64];
      int utcOffset = 0;
      struct tm timeinfo;

      ntptimeset = true;
      nvs_get_string ("ntpserver", ntpserver, "pool.ntp.org", sizeof("ntpserver"));
      utcOffset = nvs_get_int ("utcoffset", 0) * 60;  // convert mintes to seconds
      configTime(utcOffset, 0, ntpserver);
      delay (500); // allow some initial sync time
      if(getLocalTime(&timeinfo)){
        useUTCtimestamp = true;
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.println(&timeinfo, "Time: %A, %B %d %Y %H:%M:%S");
          xSemaphoreGive(consoleSem);
        }
      }
    }
    if ((mywifimode & 1) > 0) {
      if (WiFi.status() != WL_CONNECTED) {
        if (xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10)) == pdTRUE) {
          wifi_scanNetworks();
          xSemaphoreGive(tcpipSem);
        }
        else semFailed ("tcpipSem", __FILE__, __LINE__);
        staPref = nvs_get_int ("staConnect", 0);
        #ifndef SERIALCTRL
        wiCliConnected = false;
        if ((!APrunning) && trackPower) {
          trackPower = false;
          #ifdef TRACKPWR
          digitalWrite(TRACKPWR, LOW);
          #endif
          #ifdef TRACKPWRINV
          digitalWrite(TRACKPWRINV, HIGH);
          #endif
        }
        #endif
        // Preference is to only access known access points in a strict order of preference
        if (staPref == 0) {
          networkFound = false;
          for (index = 0; index < WIFINETS && !networkFound; index++) {
            sprintf (paramName, "wifissid_%d", index);
            if (index == 0) nvs_get_string (paramName, stassid, MYSSID, sizeof(stassid));
            else nvs_get_string (paramName, stassid, "none", sizeof(stassid));
            if (strcmp (stassid, "none") != 0) {
              for (scanIndex = 0; scanIndex < numberOfNetworks && !networkFound; scanIndex++) {
                if (strcmp (stassid, WiFi.SSID(scanIndex).c_str()) == 0) {
                  sprintf (paramName, "wifipass_%d", index);
                  nvs_get_string (paramName, stapass, "none", sizeof(stapass));
                  networkFound = true;
                }
              }
            }
          }
        }
        // preference is to probe APs in sequence. only option if SSID is hidden
        else if (staPref == 3) {
          static uint8_t nextWifi = 0;

          // previously found but dropped connection
          if (nextWifi >= WIFINETS) {
            nextWifi = 0;
            // nothing found
            if (debuglevel>0 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
              Serial.printf ("%s ConnectionManager: No networks defined\r\n", getTimeStamp());
              xSemaphoreGive(consoleSem);
            }
          }
          // find next candidate
          networkFound = false;
          for (index = nextWifi++; index < WIFINETS && !networkFound; index++) {
            sprintf (paramName, "wifissid_%d", index);
            if (index == 0) nvs_get_string (paramName, stassid, MYSSID, sizeof(stassid));
            else nvs_get_string (paramName, stassid, "none", sizeof(stassid));
            if (strcmp (stassid, "none") != 0) {
              sprintf (paramName, "wifipass_%d", index);
              nvs_get_string (paramName, stapass, "none", sizeof(stapass));
              networkFound = true;
            }
          }
        }
        // Preference is to access access-points by order of signal strength preference
        else if (numberOfNetworks > 0) {
          int entryNum[numberOfNetworks];
          int strength[numberOfNetworks];
          int limit = numberOfNetworks - 1;
          int exchanger;
          bool swapped = true;

          // Prime arrays with SSID details
          for (int n=0;n < numberOfNetworks; n++) {
            entryNum[n] = n;
            strength[n] = WiFi.RSSI(n);
          }
          // simple bubble sort
          while (swapped && limit>0) {
            swapped = false;
            for (int n=0; n<limit; n++) {
              if (strength[n] < strength[n+1]) {
                swapped       = true;
                exchanger     = entryNum[n];
                entryNum[n]   = entryNum[n+1];
                entryNum[n+1] = exchanger;
                exchanger     = strength[n];
                strength[n]   = strength[n+1];
                strength[n+1] = exchanger;
              }
            }
          }
          // Now check if they meet our selection criteria
          for (scanIndex = 0; scanIndex < numberOfNetworks && !networkFound; scanIndex++) {
            exchanger = entryNum[scanIndex];
            // permit any open network?!! - Yikes low security bar.
            if (staPref==2 && WiFi.encryptionType(exchanger) == WIFI_AUTH_OPEN) {
              strcpy (stassid, WiFi.SSID(exchanger).c_str());
              strcpy (stapass, "none");
              networkFound = true;
            }
            // only access known access points
            else {
              for (index = 0; index < WIFINETS && !networkFound; index++) {
                sprintf (paramName, "wifissid_%d", index);
                if (index == 0) nvs_get_string (paramName, stassid, MYSSID, sizeof(stassid));
                else nvs_get_string (paramName, stassid, "none", sizeof(stassid));
                if (strcmp (stassid, "none") != 0) {
                  if (strcmp (stassid, WiFi.SSID(exchanger).c_str()) == 0) {
                    sprintf (paramName, "wifipass_%d", index);
                    nvs_get_string (paramName, stapass, "none", sizeof(stapass));
                    networkFound = true;
                  }
                }
              }
            }
          }
        }
        // Connect to the network
        if (networkFound) {
          if (debuglevel>0 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.printf ("%s WiFi Station mode connecting to: %s\r\n", getTimeStamp(), stassid);
            xSemaphoreGive (consoleSem);
          }
          if (xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10)) == pdTRUE) {
            strcpy (ssid, stassid);
            WiFi.disconnect();
            if (strcmp (stapass, "none") == 0) WiFi.begin(stassid, NULL);
            else WiFi.begin(stassid, stapass);
            xSemaphoreGive(tcpipSem);
            if ((nvs_get_int("WiFiMode", defaultWifiMode) & 2) == 0) {
              #ifdef WEBLIFETIME
              startWeb = true;
              #endif
              #ifdef RELAYPORT
              startRelay = true;
              #endif
            }
          }
          if (diagIsRunning && xSemaphoreTake(diagPortSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            diagEnqueue ('e', (char*) "### connecting to WiFi ", false);
            diagEnqueue ('e', (char*) stassid, false);
            diagEnqueue ('e', (char*) "-------------------------------------------", true);
            xSemaphoreGive(diagPortSem);
          }
          for (uint8_t n=0; n<30 && WiFi.status()!=WL_CONNECTED; n++) delay (TIMEOUT);
          if (WiFi.status() != WL_CONNECTED) {
            if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
              Serial.printf ("%s WiFi Status = ", getTimeStamp());
              switch (WiFi.status()) {
                case WL_IDLE_STATUS:     Serial.printf ("WL_IDLE_STATUS");     break;
                case WL_NO_SSID_AVAIL:   Serial.printf ("WL_NO_SSID_AVAIL");   break;
                case WL_SCAN_COMPLETED:  Serial.printf ("WL_SCAN_COMPLETED");  break;
                case WL_CONNECT_FAILED:  Serial.printf ("WL_CONNECT_FAILED");  break;
                case WL_CONNECTION_LOST: Serial.printf ("WL_CONNECTION_LOST"); break;
                case WL_DISCONNECTED:    Serial.printf ("WL_DISCONNECTED");    break;
                default: Serial.printf ("Unknown"); break;
              }
              Serial.printf ("\r\n");
              xSemaphoreGive (consoleSem);
            }
          }
          if ((!APrunning) && WiFi.status() == WL_CONNECTED && xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10)) == pdTRUE) {
            MDNS.begin(tname);
            xSemaphoreGive(tcpipSem);
          }
        }
        // Warn if no candidates found
        else {
          if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.printf ("%s WiFi Station mode: no known access point found.\r\n", getTimeStamp());
            xSemaphoreGive (consoleSem);
          }
          if ((nvs_get_int("WiFiMode", defaultWifiMode) & 2) == 0) {
            #ifdef WEBLIFETIME
            startWeb = true;
            #endif
            #ifdef RELAYPORT
            startRelay = true;
            #endif
          }
          ssid[0] = '\0';
        }
      }
    }
    // Does the web server need (re)starting?
    #ifdef WEBLIFETIME
    if (startWeb && (APrunning || WiFi.status() == WL_CONNECTED)) {
      static int8_t num = 0;
      static char label[16];
      startWeb = false;
      sprintf (label, "webServer%d", num++);
      xTaskCreate(webListener, label, 6144, NULL, 4, NULL);
    }
    #endif
    // Does the relay need to be restarted?
    #ifdef RELAYPORT
    if (startRelay && (APrunning || WiFi.status() == WL_CONNECTED)) {
      if (relayMode != NORELAY) {
        static int8_t num = 0;
        static char label[16];
        sprintf (label, "relayServer%d", num++);
        xTaskCreate(relayListener, label, 6144, NULL, 4, NULL);
      }
      else {
        if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.printf ("%s Skipping relay startup, mode is No-Relay\r\n", getTimeStamp());
          xSemaphoreGive (consoleSem);
        }
      }
      startRelay = false;
    }
    #endif
    // Does the connection to the Control System need to be estabilished?
    #ifndef SERIALCTRL
    // if Wifi connected but server not connected
    // if ((APrunning || WiFi.status() == WL_CONNECTED) && !client.connected()) {
    if ((APrunning || WiFi.status() == WL_CONNECTED) && !wiCliConnected) {
      char server[65];
      int  port;

      if ((!APrunning) && trackPower) {
        trackPower = false;
        #ifdef TRACKPWR
        digitalWrite(TRACKPWR, LOW);
        #endif
        #ifdef TRACKPWRINV
        digitalWrite(TRACKPWRINV, HIGH);
        #endif
      }
      // Use mdns to look up service
      if ((!wiCliConnected) && nvs_get_int ("mdns", 1) == 1) {
        server[0] = '\0';
        port = mdnsLookup ("_withrottle", server);
        if (port != 0 && strlen(server) > 0) {
          if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.printf ("%s MDNS look up service found: %s:%d\r\n", getTimeStamp(), server, port);
            xSemaphoreGive (consoleSem);
          }
          connect2server (server, port);
          delay (TIMEOUT * 5);
          if ((!wiCliConnected) && (client.connected() || client.connected())) wiCliConnected = true;
        }
        else if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
          Serial.printf ("%s MDNS look up: no services found.\r\n", getTimeStamp());
          xSemaphoreGive (consoleSem);
        }
      // Serial.print (WiFi.RSSI());
      }
      // now work through server list until we connect or just give up
      for (index = 0; index <WIFINETS && !wiCliConnected; index++) {
        sprintf (paramName, "server_%d", index);
        nvs_get_string (paramName, server, "none", sizeof(server));
        if (strcmp (server, "none") != 0) {
          sprintf (paramName, "port_%d", index);
          port = nvs_get_int (paramName, PORT);
          if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
            Serial.printf ("%s Attempting connection to: %s:%d\r\n", getTimeStamp(), server, port);
            xSemaphoreGive (consoleSem);
          }
          connect2server (server, port);
          delay(TIMEOUT * 5);
          if ((!wiCliConnected) && (client.connected() || client.connected())) wiCliConnected = true;
        }
      }
    }
    #endif // NOT SERIALCTRL
    delay (10000);
    // rescan networks at minute intervals
    if (bumpCount++ > 5) {
      bumpCount = 0;
      // if (xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT*10)) == pdTRUE) {
        wifi_scanNetworks(false);
        // xSemaphoreGive(tcpipSem);
      // }
    }
  }
  vTaskDelete( NULL );
}


char* wifi_EncryptionType(wifi_auth_mode_t encryptionType)
{
  switch (encryptionType) {
    case (WIFI_AUTH_OPEN):
      return (char*) "Open";
      break;
    case (WIFI_AUTH_WEP):
      return (char*) "WEP";
      break;
    case (WIFI_AUTH_WPA_PSK):
      return (char*) "WPA_PSK";
      break;
    case (WIFI_AUTH_WPA2_PSK):
      return (char*) "WPA2_PSK";
      break;
    case (WIFI_AUTH_WPA_WPA2_PSK):
      return (char*) "WPA_WPA2_PSK";
      break;
    case (WIFI_AUTH_WPA2_ENTERPRISE):
      return (char*) "WPA2_ENTERPRISE";
      break;
    }
}

void wifi_scanNetworks()
{
if (debuglevel>1) wifi_scanNetworks (true);
else wifi_scanNetworks (false);
}


