enfieldcat/ESP32_miniThrottle/connectMgr.ino
void wifi_scanNetworks(bool echo)
{
  static bool firstRun = true;

  if (WiFi.status() != WL_CONNECTED && xSemaphoreTake(rescanSem, pdMS_TO_TICKS(TIMEOUT/10)) == pdTRUE) {   // one at a time
    WiFi.disconnect();
    if (firstRun) firstRun = false;
    else WiFi.scanDelete();
    numberOfNetworks = WiFi.scanNetworks();
    if (numberOfNetworks > 65500) numberOfNetworks = 0;
    if (echo && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      if (numberOfNetworks == 0) Serial.printf ("No networks found.\r\n");
      else {
        Serial.printf("Number of networks found: %d\r\n", numberOfNetworks);
        Serial.printf("%-16s %8s %-17s Channel Type\r\n", "Name", "Strength", "Address");
        for (int i = 0; i < numberOfNetworks; i++) {
          Serial.printf ("%-16s %8d %-17s %7d %s\r\n", WiFi.SSID(i).c_str(), WiFi.RSSI(i), WiFi.BSSIDstr(i).c_str(), WiFi.channel(i), wifi_EncryptionType(WiFi.encryptionType(i)));
        }
      }
      xSemaphoreGive(consoleSem);
    }
    delay (TIMEOUT/10); // avoid back 2 back scans
    xSemaphoreGive(rescanSem);
  }
}


#ifndef SERIALCTRL
void connect2server (char *server, int port)
{
  uint32_t clientTimeout;
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s connect2server(%s, %d)\r\n", getTimeStamp(), server, port);
    xSemaphoreGive(consoleSem);
  }

  clientTimeout = nvs_get_int ("clientTimeout", TIMEOUT/4);
  if (strcmp (server, "none") == 0) return;
  if (client.connect(server, port, clientTimeout)) {
    client.setNoDelay (true);
    initialDataSent = false;
    cmdProtocol = nvs_get_int ("defaultProto", WITHROT);  // Go straight to default protocol
    if (strlen(server) < sizeof(remServerNode)-1) strcpy (remServerNode, server);
    else {
      strncpy (remServerNode, server, sizeof(remServerNode)-1);
      remServerNode[sizeof(remServerNode)-1] = '\0';
    }
    // Once connected, we can listen for returning packets
    if (diagIsRunning && xSemaphoreTake(diagPortSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      diagEnqueue ('e', (char*) "### connecting to Server ", false);
      diagEnqueue ('e', (char*) server, false);
      diagEnqueue ('e', (char*) "-------------------------------------------", true);
      xSemaphoreGive(diagPortSem);
    }
    xTaskCreate(receiveNetData, "Network_In", 4096, NULL, 4, NULL);
    // Print diagnostic
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf  ("\r\n%s Connected to server: %s:%d\r\n", getTimeStamp(), server, port);
      xSemaphoreGive(consoleSem);
    }
    if (cmdProtocol==DCCEX) {
      strcpy (remServerType, "DCC-Ex");
      initDccEx();
    }
  }
}
#endif // NOT SERIALCTRL

// https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/protocols/mdns.html
// Use this pattern to return service list
void mdnsLookup (const char *service)
{
  static const char * if_str[] = {"STA", "AP", "ETH", "MAX"};
  static const char * ip_protocol_str[] = {"V4", "V6", "MAX"};
  mdns_result_t *results = NULL;
  mdns_result_t *r;
  mdns_ip_addr_t * a = NULL;
  int i = 1, t;

  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s mdnsLookup(%s)\r\n", getTimeStamp(), service);
    xSemaphoreGive(consoleSem);
  }

  // esp_err_t mdns_query_ptr(const char *service_type, const char *proto, uint32_t timeout, size_t max_results, mdns_result_t **results)
  esp_err_t err = mdns_query_ptr(service, "_tcp", 3000, 20,  &results);

  if ((!err) && results != NULL && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    r = results;
    while (r){
      #ifdef ESP_ARDUINO_VERSION_MAJOR
      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      Serial.printf("%d: IP Protocol: %s\r\n", i++, ip_protocol_str[r->ip_protocol]);
      #else
      Serial.printf("%d: Interface: %s, Type: %s\r\n", i++, if_str[r->tcpip_if], ip_protocol_str[r->ip_protocol]);
      #endif
      #else
      Serial.printf("%d: Interface: %s, Type: %s\r\n", i++, if_str[r->tcpip_if], ip_protocol_str[r->ip_protocol]);
      #endif
      if (r->instance_name){
        Serial.printf("  PTR : %s\r\n", r->instance_name);
      }
      if (r->hostname){
         Serial.printf("  SRV : %s.local:%u\r\n", r->hostname, r->port);
      }
      if (r->txt_count){
        Serial.printf("  TXT : [%u] ", r->txt_count);
        for(t=0; t<r->txt_count; t++){
          Serial.printf("%s=%s; ", r->txt[t].key, r->txt[t].value);
        }
        Serial.printf("\r\n");
      }
      a = r->addr;
      while (a){
        if(a->addr.type == IPADDR_TYPE_V6){
          Serial.printf("  AAAA: " IPV6STR "\r\n", IPV62STR(a->addr.u_addr.ip6));
        } else {
          Serial.printf("  A   : " IPSTR "\r\n", IP2STR(&(a->addr.u_addr.ip4)));
        }
        a = a->next;
      }
      r = r->next;
    }
    xSemaphoreGive(consoleSem);
  }

  if (results!=NULL) {
    mdns_query_results_free (results);
  }
}

void mdnsScanService ()
{
  char* mdnsServiceList[] = {"withrottle", "http", "arduino", "workstation", "smb", "afpovertcp", "ftp", "ipp", "ipps", "printer", "scanner", "airplay", "googlecast", "sonos", "dlna", "spotify-connect", "ssh", "sftp-ssh", "ftp", "snmp"};
  int i = sizeof(mdnsServiceList) / sizeof(char*);

  for (int n=0; n<i; n++) mdbsBrowseService (mdnsServiceList[n], "tcp");
}

// Query a specific service
void mdbsBrowseService(const char *service, const char *proto) {
  int n = MDNS.queryService(service, proto);
  if (n > 0) {
    Serial.print(n);
    Serial.println(" service(s) found");
    for (int i = 0; i < n; ++i) {
      // Print details for each service found
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.print("  ");
        Serial.print(i + 1);
        Serial.print(": ");
        Serial.printf("_%s._%s.local: ", service, proto);
        //Serial.print(MDNS.instanceName(i));
        //Serial.print(" - ");
        Serial.print(MDNS.hostname(i));
        //Serial.print(" (");
        //Serial.print(MDNS.address(i));
        Serial.print(":");
        Serial.print(MDNS.port(i));
        Serial.println("");
        xSemaphoreGive(consoleSem);
      }
    }
  }
  Serial.println();
}


// mdns lookup of service, returns port number and writes the IP address to the buffer pointed to by *addr
int mdnsLookup (const char *service, char *addr)
{
  int retVal = 0;

  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s mdnsLookup(%s, %x)\r\n", getTimeStamp(), service, addr);
    xSemaphoreGive(consoleSem);
  }

  mdns_result_t *results = NULL;
  mdns_result_t *r;
  mdns_ip_addr_t * a = NULL;

  addr[0] = '\0';
  esp_err_t err = mdns_query_ptr(service, "_tcp", 3000, 20,  &results);
  if ((!err) && results != NULL) {
    r = results;
    while (r && addr[0]=='\0'){
      retVal = r->port;
      a = r->addr;
      while (a){
        if(a->addr.type == IPADDR_TYPE_V6){
          sprintf(addr, IPV6STR, IPV62STR(a->addr.u_addr.ip6));
        } else {
          sprintf(addr, IPSTR,   IP2STR(&(a->addr.u_addr.ip4)));
        }
        a = a->next;
      }
      r = r->next;
    }
  }

  if (results!=NULL) {
    mdns_query_results_free (results);
  }
  return (retVal);
}

