enfieldcat/ESP32_miniThrottle/connectMgr.ino
#ifndef SERIALCTRL
// Transmit a packet
void txPacket (const char *header, const char *pktData)
{
  if (!wiCliConnected) return;
  if (pktData == NULL) return;
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    if (header==NULL) Serial.printf ("%s txPacket(NULL, %s)\r\n", getTimeStamp(), pktData);
    else Serial.printf ("%s txPacket(%s, %s)\r\n", getTimeStamp(), header, pktData);
    xSemaphoreGive(consoleSem);
  }

  if (xSemaphoreTake(tcpipSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    if (header != NULL) {
      if (client.write ((const uint8_t*) header, strlen(header)) < 0) wiCliConnected = false;
    }
    if (wiCliConnected && client.write ((const uint8_t*) pktData, strlen(pktData)) < 0) wiCliConnected = false;
    if (wiCliConnected && client.write ((const uint8_t*) "\r\n", 2) < 0) wiCliConnected = false;
    client.flush();
    xSemaphoreGive(tcpipSem);
    resetKeepAlive();
    if (diagIsRunning && xSemaphoreTake(diagPortSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      if (!wiCliConnected) diagEnqueue ('p', (char*) "connection failed on: ", false);
      diagEnqueue ('p', (char *) "--> ", false);
      if (header != NULL) {
        diagEnqueue ('p', (char*) header, false);
      }
      diagEnqueue ('p', (char*) pktData, true);
      xSemaphoreGive(diagPortSem);
    }
    if (showPackets) {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.print ("--> ");
        if (header != NULL) Serial.print (header);
        Serial.println (pktData);
        xSemaphoreGive(consoleSem);
      }
    }
  }
  else {
    if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      Serial.printf ("%s ERROR: Could not get semaphore to transmit data\r\n", getTimeStamp());
      xSemaphoreGive(consoleSem);
    }
  }
}
#endif // NOT SERIALCTRL
#endif // USEWIFI


#ifdef SERIALCTRL
//void connectionManager()
// Run as a separate thread in case there are start up delays in running population or connection routines
void serialConnectionManager(void *pvParameters)
{
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    Serial.printf ("%s serialConnectionManager(NULL)\r\n", getTimeStamp());
    xSemaphoreGive(consoleSem);
  }

  // Connect to DCC-Ex over serial connection
  if (xSemaphoreTake(serialSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    serial_dev.begin (DCCSPEED, SERIAL_8N1, DCCRX, DCCTX);
    cmdProtocol = DCCEX;
    xSemaphoreGive(serialSem);
    delay (1500);
    // Once connected, we can listen for returning packets
    xTaskCreate(receiveNetData, "Network_In", 5120, NULL, 4, NULL);
  }
  else semFailed ("serialSem", __FILE__, __LINE__);
  delay (1500);
  initDccEx();
  vTaskDelete( NULL );
}

// Transmit a packet
void txPacket (const char *header, const char *pktData)
{
  if (pktData == NULL) return;
  if (debuglevel>2 && xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    if (header==NULL) Serial.printf ("%s txPacket(NULL, %s)\r\n", getTimeStamp(), pktData);
    else Serial.printf ("%s txPacket(%s, %s)", getTimeStamp(), header, pktData);
    xSemaphoreGive(consoleSem);
  }
  if (xSemaphoreTake(serialSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
    if (header!=NULL) {
      serial_dev.write ((const uint8_t*)header, strlen(header));
    }
    serial_dev.write ((const uint8_t*)pktData, strlen(pktData));
    serial_dev.write ((const uint8_t*)"\r\n", 2);
    xSemaphoreGive(serialSem);
    #ifdef USEWIFI
    if (diagIsRunning && xSemaphoreTake(diagPortSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      diagEnqueue ('p', (char *) "--> ", false);
      if (header!=NULL) {
        diagEnqueue ('p', (char*) header, false);
      }
      diagEnqueue ('p', (char*) pktData, true);
      xSemaphoreGive(diagPortSem);
    }
    #endif
    if (showPackets) {
      if (xSemaphoreTake(consoleSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
        Serial.print ("--> ");
        if (header != NULL) Serial.print (header);
        Serial.println (pktData);
        xSemaphoreGive(consoleSem);
      }
    }
    #ifdef RELAYPORT
    if (xSemaphoreTake(relaySvrSem, pdMS_TO_TICKS(TIMEOUT)) == pdTRUE) {
      localoutPkts ++;
      xSemaphoreGive(relaySvrSem);
    }
    else semFailed ("relaySvrSem", __FILE__, __LINE__);
    #endif
  }
  else semFailed ("serialSem", __FILE__, __LINE__);
}
#endif // SERIALCTRL


void initDccEx()
{
  // Send initial data
  setInitialData();
  // Load stored data from Non-Volatile Storage (NVS)
  dccPopulateLoco();
  if (nvs_get_int("sortData", SORTDATA) == 1) sortLoco();
  dccPopulateTurnout();
  if (nvs_get_int("sortData", SORTDATA) == 1) sortTurnout();
  dccPopulateRoutes();
  if (nvs_get_int("sortData", SORTDATA) == 1) sortRoute();
}


void txPacket (const char *pktData)
{
  txPacket (NULL, pktData);
}
